Revit 2026 API

# Field Methods

---

The Field type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CompatibleUnit | Checks if the specified unit is compatible with the field description. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSpecTypeId | Gets the spec describing the values stored in this field. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SubEntityReadAccessGranted | Checks whether there is read access to subentities storable in this field. |
|  | SubEntityWriteAccessGranted | Checks whether there is write access to subentities storable in this field. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Field Class

Autodesk.Revit.DB.ExtensibleStorage Namespace